In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
data = pd.read_csv('potato.csv')
data

             Date      Centre_Name Commodity_Name  Price
0      01-01-2013       CHANDIGARH         Potato    8.0
1      01-01-2013            DELHI         Potato   12.0
2      01-01-2013            HISAR         Potato    NaN
3      01-01-2013           KARNAL         Potato    NaN
4      01-01-2013           SHIMLA         Potato    NaN
...           ...              ...            ...    ...
33779  28-04-2015         DINDIGUL         Potato   17.0
33780  28-04-2015  THIRUCHIRAPALLI         Potato   17.0
33781  28-04-2015       COIMBATORE         Potato   16.0
33782  28-04-2015      TIRUNELVELI         Potato   16.0
33783  28-04-2015        HYDERABAD         Potato   22.0

[33784 rows x 4 columns]

In [4]:
data.head()

         Date Centre_Name Commodity_Name  Price
0  01-01-2013  CHANDIGARH         Potato    8.0
1  01-01-2013       DELHI         Potato   12.0
2  01-01-2013       HISAR         Potato    NaN
3  01-01-2013      KARNAL         Potato    NaN
4  01-01-2013      SHIMLA         Potato    NaN

In [ ]:
# drop -> date, Commodity_Name
# label encoder -> Centre_Name

In [7]:
data.Commodity_Name.unique()

array(['Potato'], dtype=object)

In [8]:
data.Centre_Name.unique()

array(['CHANDIGARH', 'DELHI', 'HISAR', 'KARNAL', 'SHIMLA', 'MANDI',
       'SRINAGAR', 'JAMMU', 'AMRITSAR', 'LUDHIANA', 'BATHINDA', 'LUCKNOW',
       'KANPUR', 'VARANASI', 'AGRA', 'DEHRADUN', 'RAIPUR', 'PANAJI',
       'AHMEDABAD', 'RAJKOT', 'BHOPAL', 'INDORE', 'GWALIOR', 'JABALPUR',
       'MUMBAI', 'NAGPUR', 'JAIPUR', 'JODHPUR', 'KOTA', 'PATNA',
       'BHAGALPUR', 'RANCHI', 'BHUBANESHWAR', 'CUTTACK', 'SAMBALPUR',
       'KOLKATA', 'SILIGURI', 'PORT BLAIR', 'ITANAGAR', 'GUWAHATI',
       'SHILLONG', 'AIZWAL', 'DIMAPUR', 'AGARTALA', 'VIJAYWADA',
       'BENGALURU', 'DHARWAD', 'T.PURAM', 'ERNAKULAM', 'KOZHIKODE',
       'PUDUCHERRY', 'CHENNAI', 'DINDIGUL', 'THIRUCHIRAPALLI',
       'HYDERABAD', 'ROURKELA', 'VISAKHAPATNAM', 'PANCHKULA', 'GURGAON',
       'REWA', 'SAGAR', 'COIMBATORE', 'TIRUNELVELI', 'PURNIA', 'THRISSUR',
       'PALAKKAD', 'WAYANAD', 'HALDWANI', 'DHARAMSHALA', 'MANGALORE',
       'MYSORE'], dtype=object)

In [16]:
# drop values 
data_droped = data.copy()
data_droped.drop(columns=['Commodity_Name'], inplace=True)

In [17]:
data_droped

             Date      Centre_Name  Price
0      01-01-2013       CHANDIGARH    8.0
1      01-01-2013            DELHI   12.0
2      01-01-2013            HISAR    NaN
3      01-01-2013           KARNAL    NaN
4      01-01-2013           SHIMLA    NaN
...           ...              ...    ...
33779  28-04-2015         DINDIGUL   17.0
33780  28-04-2015  THIRUCHIRAPALLI   17.0
33781  28-04-2015       COIMBATORE   16.0
33782  28-04-2015      TIRUNELVELI   16.0
33783  28-04-2015        HYDERABAD   22.0

[33784 rows x 3 columns]

In [18]:
len(data.Date.unique())

566

In [45]:
days = []
months = []
years = []
for date in data.Date:
    day, month, year = date.split('-')
    days.append(int(day))
    months.append(int(month))
    years.append(int(year))

In [46]:
print(set(days))
print(len(set(days)))

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31}
31

In [47]:
print(set(months))
print(len(set(months)))

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12}
12

In [48]:
# we can split the date into 3 columns

In [49]:
len(days)

33784

In [50]:
len(months)

33784

In [51]:
len(years)

33784

In [52]:
data_dictionary = {'Days':days, 'Months':months, 'Years':years}
date_dataframe = pd.DataFrame(data_dictionary)

In [53]:
date_dataframe

       Days  Months  Years
0         1       1   2013
1         1       1   2013
2         1       1   2013
3         1       1   2013
4         1       1   2013
...     ...     ...    ...
33779    28       4   2015
33780    28       4   2015
33781    28       4   2015
33782    28       4   2015
33783    28       4   2015

[33784 rows x 3 columns]

In [54]:
date_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33784 entries, 0 to 33783
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Days    33784 non-null  int64
 1   Months  33784 non-null  int64
 2   Years   33784 non-null  int64
dtypes: int64(3)
memory usage: 791.9 KB

In [59]:
new_dataframe = pd.concat([date_dataframe, data_droped], axis=1)
new_dataframe.drop(columns=['Date'], inplace=True)

In [60]:
new_dataframe

       Days  Months  Years      Centre_Name  Price
0         1       1   2013       CHANDIGARH    8.0
1         1       1   2013            DELHI   12.0
2         1       1   2013            HISAR    NaN
3         1       1   2013           KARNAL    NaN
4         1       1   2013           SHIMLA    NaN
...     ...     ...    ...              ...    ...
33779    28       4   2015         DINDIGUL   17.0
33780    28       4   2015  THIRUCHIRAPALLI   17.0
33781    28       4   2015       COIMBATORE   16.0
33782    28       4   2015      TIRUNELVELI   16.0
33783    28       4   2015        HYDERABAD   22.0

[33784 rows x 5 columns]

In [61]:
# apply label encoder on Centre_Name
from sklearn.preprocessing import LabelEncoder
lb = LabelEncoder()
new_dataframe['Centre_Name'] = lb.fit_transform(new_dataframe['Centre_Name'])

In [62]:
new_dataframe

       Days  Months  Years  Centre_Name  Price
0         1       1   2013           10    8.0
1         1       1   2013           15   12.0
2         1       1   2013           25    NaN
3         1       1   2013           34    NaN
4         1       1   2013           60    NaN
...     ...     ...    ...          ...    ...
33779    28       4   2015           19   17.0
33780    28       4   2015           64   17.0
33781    28       4   2015           12   16.0
33782    28       4   2015           66   16.0
33783    28       4   2015           26   22.0

[33784 rows x 5 columns]

In [69]:
# price column
# count missing values
new_dataframe.Price.isna().sum()

5247

In [72]:
new_dataframe.dropna(inplace=True)

In [73]:
new_dataframe

       Days  Months  Years  Centre_Name  Price
0         1       1   2013           10    8.0
1         1       1   2013           15   12.0
5         1       1   2013           40   16.0
6         1       1   2013           62   20.0
7         1       1   2013           31   15.0
...     ...     ...    ...          ...    ...
33779    28       4   2015           19   17.0
33780    28       4   2015           64   17.0
33781    28       4   2015           12   16.0
33782    28       4   2015           66   16.0
33783    28       4   2015           26   22.0

[28537 rows x 5 columns]

# data spliting

In [74]:
# determine x and y
X = new_dataframe.iloc[:,:-1]
Y = new_dataframe.iloc[:,-1]

In [75]:
X.shape

(28537, 4)

In [76]:
Y.shape

(28537,)

In [77]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(X, Y, test_size=0.2, random_state=5)

# apply Scaling

In [78]:
from sklearn.preprocessing import StandardScaler
Scaler = StandardScaler()
x_train_scaled = Scaler.fit_transform(x_train)
x_test_scaled = Scaler.transform(x_test)

# Model Building and Training

In [79]:
from sklearn.linear_model import LinearRegression
linear_regression_model = LinearRegression()
linear_regression_model.fit(x_train_scaled, y_train)

LinearRegression()

In [80]:
linear_regression_model.coef_

array([0.02760853, 3.96420013, 1.85452994, 0.36360988])

In [81]:
linear_regression_model.intercept_

19.65118927679707

In [82]:
y_predict = linear_regression_model.predict(x_test_scaled) 
y_predict

array([16.85164221, 13.08040603, 17.5160967 , ..., 27.14813314,
       14.37901194, 25.43555818])

In [83]:
from sklearn.metrics import mean_absolute_error, mean_squared_error
MSE = mean_squared_error(y_test, y_predict)
MSE

39.368638743233205

In [84]:
MAE = mean_absolute_error(y_test, y_predict)
MAE

4.925532265833125